In [2]:
import pandas as pd
import numpy as np

In [43]:
# 1. Create a DataFrame with columns 'A', 'B', and 'C' and rows labeled 'Row1', 'Row2', and 'Row3'.
col = ['A', 'B', 'C']
row = ['Row1', 'Row2','Row3']
data = [
    [35,25,45],
    [10,np.nan,25],
    [101,210,525]
]
df = pd.DataFrame(data=data,columns=col,index=row)
df

        A      B    C
Row1   35   25.0   45
Row2   10    NaN   25
Row3  101  210.0  525

In [19]:
# 2. Select only the 'A' column from the DataFrame.
df['A']

Row1     35
Row2     10
Row3    101
Name: A, dtype: int64

In [20]:
# 3. Select both the 'A' and 'C' columns from the DataFrame.
df[['A','C']]

        A    C
Row1   35   45
Row2   10   25
Row3  101  525

In [26]:
# 4. Select the row labeled 'Row2' from the DataFrame.
# 5. Select the second row of the DataFrame using its position.
df.loc['Row2']
df.iloc[1]

A    10
B    20
C    25
Name: Row2, dtype: int64

In [27]:
# 6. Filter the DataFrame to include only rows where the value in column 'A' is greater than 1.
df[df['A'] > 10]

        A    B    C
Row1   35   25   45
Row3  101  210  525

In [28]:

# 7. Filter the DataFrame to include rows where 'A' is greater than 1 and 'B' is less than 6.
df[(df['A'] > 10) & (df['B'] < 100)]

       A   B   C
Row1  35  25  45

In [29]:
# 8. Add a new column 'D' to the DataFrame that is the sum of columns 'A' and 'B'.
df['D'] = df['A'] + df['B']
df

        A    B    C    D
Row1   35   25   45   60
Row2   10   20   25   30
Row3  101  210  525  311

In [33]:
# 9. Remove the column 'D' from the DataFrame.
df.drop('D',axis=1,inplace=True)
df

        A    B    C
Row1   35   25   45
Row2   10   20   25
Row3  101  210  525

In [35]:
# 10. Group the DataFrame by the values in column 'A' and calculate the mean for other columns.
df.groupby('A').mean()

         B      C
A
10    20.0   25.0
35    25.0   45.0
101  210.0  525.0

In [41]:
# 11. Sort the DataFrame by the values in column 'B' in ascending order.
# 12. Sort the DataFrame by the values in column 'C' in descending order.
df.sort_values('B',ascending=False)

        A      B    C
Row3  101  210.0  525
Row1   35   25.0   45
Row2   10    NaN   25

In [40]:
# 13. Check which cells in the DataFrame have null values.
df.isnull()

          A      B      C
Row1  False  False  False
Row2  False   True  False
Row3  False  False  False

In [42]:
# 14. Remove rows from the DataFrame that contain any null values.

df.dropna()

        A      B    C
Row1   35   25.0   45
Row3  101  210.0  525

In [45]:
# 15. Fill null values in the DataFrame with the number 0.
df.fillna(0)

        A      B    C
Row1   35   25.0   45
Row2   10    0.0   25
Row3  101  210.0  525

In [54]:
# 16. Merge the DataFrame with another DataFrame on the column 'A'.
df2 = pd.DataFrame(data=[[35,10,101],[25,5,6],[7,8,9]],index=['row1','row2','row3'],columns=['A','B','C'])
print(df)
print(df2)
merged = df.merge(df2,on='A')

merged

        A      B    C
Row1   35   25.0   45
Row2   10    NaN   25
Row3  101  210.0  525
       A   B    C
row1  35  10  101
row2  25   5    6
row3   7   8    9

    A   B_x  C_x  B_y  C_y
0  35  25.0   45   10  101

In [61]:
# 17. Concatenate the DataFrame with another DataFrame along the rows.
# 18. Reset the index of the DataFrame to start from 0.
concated_arr = pd.concat([df,df2],axis=0).reset_index(drop=True)
concated_arr

     A      B    C
0   35   25.0   45
1   10    NaN   25
2  101  210.0  525
3   35   10.0  101
4   25    5.0    6
5    7    8.0    9

In [62]:
# 19. Create a summary of the DataFrame showing the count, mean, and standard deviation for each
#column.

concated_arr.describe()

                A           B           C
count    6.000000    5.000000    6.000000
mean    35.500000   51.600000  118.500000
std     34.244708   88.883632  202.158106
min      7.000000    5.000000    6.000000
25%     13.750000    8.000000   13.000000
50%     30.000000   10.000000   35.000000
75%     35.000000   25.000000   87.000000
max    101.000000  210.000000  525.000000

In [63]:

# 20. Count the number of unique values in column 'A'.

concated_arr['A'].unique()

array([ 35,  10, 101,  25,   7], dtype=int64)